package Lesson5;

import java.util.HashMap;
import java.util.Map;

public class Ex001_HashMap {
    public static void main(String[] args) {
        Map<Integer, String> db = new HashMap<>(); //создали Map(словарь) с двумя типами: Integer для ключа, String для значений
//        db.putIfAbsent(1, "один"); // Добавление с проверкой. Если ключа 1 нет, добавит. Ключ=1, значение=один. Если ключ есть - ничего не добавит.
//        db.put(2, "два"); //Добавили в словарь db новое значение, где ключ = 2, значение = два. При повторном добавлении в этот ключ значение перезаписывается
//        db.put(null; "!null"); //Добавили в словарь запись, где ключ=null
//        db.containsKey(1);//проверяет, есть ли такой ключ в словаре. Возвращает True - если ключ есть.
//        db.containsValue("один");//проверяет, есть ли такое значение в словаре. Возвращает True - если значение есть.
//        db.keySet();//получить множество всех ключей
//        db.values();//получить набор всех значений
//        db.get(1); //получение значения по ключу
//        db.remove(1);//удаляет пару по указанному ключу

//        System.out.println(db); //{1=один, 2=два} - вывод словаря на экран


    }
}
